package wwee.jihun.Prompt;

import lombok.Getter;
import lombok.Setter;
import org.springframework.stereotype.Component;

@Getter
@Setter
@Component
public class FormPrompt {
    private String Sns = "첫 번째 스토리: \"환경 친화적인 선택\"\n" +
            "사진: 다양한 재활용 제품 (재활용 종이, 금속, 유리 등)을 보여줌\n" +
            "문구: \"우리는 미래를 위해 새로운 선택을 할 수 있습니다. 재활용 제품은 환경을 보호하고 우리의 지구를 깨끗하게 유지하는 데 큰 역할을 합니다. 함께 환경 친화적인 선택을 해볼까요? #환경을위한변화 #재활용제품 #지구를사랑합니다\"\n" +
            "두 번째 스토리: \"대학생들의 열정\"\n" +
            "사진: 다양한 대학생들이 활동하는 장면을 보여줌 (환경 동아리, 재활용 센터 등)\n" +
            "문구: \"대학생들은 새로운 변화를 추구하는 열정적인 청춘들입니다. 우리는 환경을 위해 힘을 합치고, 재활용 제품의 중요성을 알리는 우리의 역할을 이해하고 있습니다. 함께 변화를 이루는 우리의 모습을 보여드릴까요? #대학생 #환경활동 #변화를위해함께\"\n" +
            "세 번째 스토리: \"재활용 제품의 매력\"\n" +
            "사진: 다양한 재활용 제품을 사용한 스타일리시한 사람들의 사진\n" +
            "문구: \"재활용 제품은 환경을 위한 선택일 뿐만 아니라 스타일과 매력을 더할 수 있는 아이템입니다. 우리의 삶에 환경과 스타일을 동시에 반영해보는 건 어떨까요? 재활용 제품으로 새로운 스타일을 만들어보세요! #환경과스타일 #재활용제품 #지속가능한삶\"\n" +
            "네 번째 스토리: \"우리의 작은 실천\"\n" +
            "사진: 대학생들이 재활용 제품을 사용하는 모습을 보여줌\n" +
            "문구: \"작은 실천으로도 큰 변화를 이룰 수 있습니다. 우리가 일상에서 재활용 제품을 사용하는 것은 지구를 지키는 작은 습관입니다. 재활용 종이를 사용하면 나무를 보호하고, 재활용 금속을 사용하면 자원을 절약하며, 재활용 유리를 사용하면 자연을 아름답게 유지할 수 있습니다. 우리 모두가 소중한 지구를 위해 이 작은 습관을 실천해보세요. 함께 변화를 만들어나갑시다! ?? #작은실천 #재활용제품 #지구를위한변화”";

}
